import requests
import json
import xmltodict
import pandas as pd


plants = [['가울테리아', '12938'], 
['개운죽', '12954'], 
["골드크레스트 '윌마'", '12955'], 
['공작야자', '12957'], 
['관엽베고니아', '12962'], 
['관음죽', '12963'], 
['구문초', '12966'], 
['구즈마니아', '12972'], ['군자란', '12974'], ['글레코마', '12988'], ['금목서', '12990'], ['금사철나무', '12994'], ['금식나무', '12998'], ['금전수', '13186'], ['금천죽', '13196'], ['기누라', '13199'], ['꽃베고니아', '13201'], ['나도풍란', '13202'], ['나한송', '13203'], ['남천', '13206'], ['네마탄투스', '13207'], ['네오레겔리아', '13208'], ['녹영', '13210'], ['뉴기니아봉선화', '13218'], 
['대만고무나무', '13333'], ['더피고사리', '13335'], ['덕구리난', '13336'], ['데코라고무나무', '13337'], ['덴파레', '13338'], ['도깨비고비', '13339'], ['돈나무', '13340'], ['동백', '14663'], ['둥근잎 아랄리아', '14674'], ['듀란타', '14675'], ["드라세나  '송오브자마이카'", '14676'], 
["드라세나  '와네끼'", '14687'], ["드라세나 '송오브인디아'", '14694'], ["드라세나 '자바'", '14696'], ["드라세나 '콤팩타'", '14697'], 
["드라세나 '트리 컬러 레인보우'", '14698'], ['드라세나 드라코', '14688'], ['드라세나 마지나타', '14689'], ['드라세나 맛상게아나', '14690'], 
['드라세나 산데리아나', '14691'], ["드라세나 산데리아나 '세레스'", '14692'], ['드라세나 수르쿨로사', '14695'], ['디지고데카', '14699'], ["디펜바키아 '마리안느'", '14700'], ["디펜바키아 '트로픽스노우'", '14713'], ['떡갈잎 고무나무', '14911'], ['러브체인', '14913'], ['렉스베고니아', '14920'], 
['루모라고 사리', '15830'], ['루스커스', '16034'], ['마란타 류코뉴라', '16038'], ['마삭줄', '16238'], ['만년청', '16239'], ['만데빌라', '16241'], 
['멕시 코소철', '16245'], ['멜라니 고무나무', '16246'], ['목베고니아', '16448'], ['몬스테라', '16449'], ['무늬관음죽', '17749'], ['무늬마삭줄', '17750'], ['무늬벤자민고무나무', '17751'], ['무늬산호수', '18575'], ['무늬석창포', '18576'], ["무늬쉐플레라'홍콩'", '18593'], ['무늬알피니아', '18596'], ['무늬유카', '18597'], ['무늬접란', '18599'], ['무늬털머위', '18600'], ['무늬팻츠헤데라', '18602'], ['무늬푸밀라고무나무', '18604'], 
['뮤렌베키아', '18649'], ['바위취', '18656'], ['박쥐란', '18659'], ['반딧불털머위', '18692'], ['백량금', '18694'], ['백정화', '14915'], 
['백화등', '14916'], ['벤자민고무나무', '14919'], ["벤자민고무나무 '킹'", '15828'], ['벵갈고무나무', '15831'], ['병솔나무', '15835'], ['보스톤고사리', '16037'], ['봉의꼬리', '16138'], ['부겐빌레아', '18613'], ['브룬펠시아', '18652'], ['브리세아', '18655'], ['비젯티접란', '18695'], 
['비타툼접란', '18697'], ['산세베리아', '19448'], ["산세베리아 '골든 하니'", '19449'], ['산호수', '19451'], ['삼색데코라고무나무', '19452'], 
["상록넉줄 고사리 '후마타'", '19453'], ['새우란', '19455'], ['석창포', '19457'], ['세네시오 라디칸스', '19460'], ['세이프릿지 야자', '19663'],
['셀라기넬라', '19696'], ['소철', '19701'], ['소피아 고무나무', '19703'], ['솔레이롤리아', '19704'], ['수박페페로미아', '19706'], ['수박필레아', '19709'], ['수염 틸란드시아', '19711'], ['숙근이베리스', '19713'], ["쉐플레라 '홍콩'", '19715'], ['스킨답서스', '19716'], ['스파티필룸', '19717'], ['스파티필룸 (광엽)', '19718'], ['시서스', '19719'], ['시클라멘', '19707'], ['심비디움', '19712'], ['싱고니움', '19714'], ['아글라오네마', '19469'], ['아데니움', '19468'], ['아디안텀', '19467'], ['아라우카리아', '19466'], ['아레카야자', '19465'], ['아마릴리스', '19470'], 
['아스파라거스 풀루모수스', '19464'], ['아스플레니움', '19463'], ['아왜나무', '19462'], ['아이비', '19461'], ['아펠란드라', '19459'], 
['아프리칸 바이올렛', '18691'], ['안수리움', '18660'], ['알로카시아 아마조니카', '18658'], ['알로카시아 쿠쿨라타', '19471'], ['얼룩자주달개비', '18657'], 
['에메랄드리플 페페로미아', '18654'], ['에크메아 파시아타', '18601'], ['엘라티올 베고니아', '18598'], ['여우꼬리풀', '18595'], ['엽란', '18591'], 
['옥살리스(사랑초)', '19474'], ['온시디움', '18589'], ['왜란', '18588'], ['왜성종려죽', '18587'], ['움벨라타 고무나무', '18585'], ['유카', '18582'], ['은사철나무', '18581'], ['익소라', '18578'], ['인삼벤자민', '17748'], ['자금우', '17741'], ['자란', '17393'], ['자주색만년초', '16450'], 
['접란', '16447'], ['제라니움', '16248'], ['좀마삭줄', '16242'], ['종려방동사니', '16036'], ['종려죽', '16035'], ['죽백나무', '16033'], 
['줄리아 페페로미아', '15834'], ['참쇠고비(섬쇠고비)', '12991'], ['치자나무', '12989'], ['칼라데아 마코야나', '15829'], ['칼라데아 인시그니스', '14918'], ['칼라데아 크로카타', '14917'], ['칼라디움', '14914'], ['칼랑코에', '13319'], ['커피나무', '13317'], ['켄챠야자', '13318'], 
['코르딜리네 레드에지', '13309'], ['크로톤', '13260'], ['크로톤', '13261'], ['크립탄서스', '13257'], ['클레마티스', '13255'], ['털달개비', '12996'], 
['털머위', '13001'], ['테이블야자', '13002'], ['톨미아', '13003'], ['틸란드시아', '13004'], ['파키라', '13248'], ['파피오페딜럼', '13247'], 
['팔레놉시스(호접란)', '13245'], ['팔손이나무', '13244'], ['팬더 고무나무', '13242'], ['팻츠헤데라', '13253'], ['페페로미아 오브투시폴리아', '13240'], ['페페로미아 클루시폴리아', '13216'], ['페페로미아 푸테올라타', '13215'], ['포인세티아', '13214'], ['폴리시아스', '13213'], ['푸밀라고무나무', '13212'], ['프테리스', '13211'], ['피라칸사', '13209'], ['피토니아 핑크스타', '13251'], ['피토니아 화이트스타', '13197'], 
['픽투라툼 접란', '13194'], ['필레아 글라우카(타라, 블루체인)', '13193'], ["필로덴드론 '선라이트'", '13190'], ["필로덴드론 '제나두'", '13187'], 
['필로덴드론 고엘디', '13192'], ['필로덴드론 레몬라임', '13191'], ['필로덴드론 셀로움', '13189'], ['필로덴드론 옥시카르디움', '13188'], ['필로덴드론 콩고', '13249'], ['해마리아', '12987'], ['행운목', '12983'], ['헤미오니티스(하트펀)', '12981'], ['헤테로파낙스 프라그란스 (해피트리)', '12979'], 
['협죽도', '12978'], ['형광스킨답서스', '12976'], ['호야', '12986'], ['호야 엑소티카', '12975'], ['호주매', '12973'], ['홀리아페페로미아', '12971'], ['황금마삭줄', '12937'], ['황금죽', '12932'], ['후피향나무', '12956'], ['흰꽃나도사프란', '12920'], ['흰줄무늬달개비(트라데스칸티아)', '12919'], ['히포에스테스', '12901']]
plants_detail_list = []
for plant in plants:
    # print(plant[1])
    res = requests.get(f'http://api.nongsaro.go.kr/service/garden/gardenDtl?apiKey=202203049T5USJE5RIEGM7DV3L0W&cntntsNo={plant[1]}')
    # print(res)
    # soup = BeautifulSoup(res.content, 'xml')
    jsonString = json.dumps(xmltodict.parse(res.text), indent=4, ensure_ascii=False)
    jsontype = json.loads(jsonString)
    plant_detail = jsontype['response']['body']['item']
    plant_detail_dict = {
        'plant_name': plant[0],
        # 'plant_place_code': plant_detail['postngplaceCode'],
        'plant_place': plant_detail['postngplaceCodeNm'],
        'plant_grow_tmp_code': plant_detail['grwhTpCode'],
        'plant_grow_tmp': plant_detail['grwhTpCodeNm'],
        # 'plant_req_sun_code': plant_detail['lighttdemanddoCode'],
        'plant_req_sun': plant_detail['lighttdemanddoCodeNm'],
        'plant_manage_code': plant_detail['managelevelCode'],
        'plant_manage': plant_detail['managelevelCodeNm'],
        'plant_water_spring_code': plant_detail['watercycleSprngCode'],
        'plant_water_spring': plant_detail['watercycleSprngCodeNm'],
        'plant_water_summer_code': plant_detail['watercycleSummerCode'],
        'plant_water_summer': plant_detail['watercycleSummerCodeNm'],
        'plant_water_autumn_code': plant_detail['watercycleAutumnCode'],
        'plant_water_autumn': plant_detail['watercycleAutumnCodeNm'],
        'plant_water_winter_code': plant_detail['watercycleWinterCode'],
        'plant_water_winter': plant_detail['watercycleWinterCodeNm'],
        'plant_soil': plant_detail['soilInfo'],
        'plant_humidity_code': plant_detail['hdCode'],
        'plant_humidity': plant_detail['hdCodeNm'],
    }
    plants_detail_list.append(plant_detail_dict)

df = pd.DataFrame(plants_detail_list)
df.to_csv('plants_detail_csv')


